## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.gke-cinema.google_container_cluster.primary has been deleted
-   resource "google_container_cluster" "primary" {
-       cluster_ipv4_cidr           = "10.4.1.0/24" -> null
-       default_max_pods_per_node   = 128 -> null
-       enable_autopilot            = false -> null
-       enable_binary_authorization = false -> null
-       enable_intranode_visibility = false -> null
-       enable_kubernetes_alpha     = false -> null
-       enable_legacy_abac          = false -> null
-       enable_shielded_nodes       = true -> null
-       enable_tpu                  = false -> null
-       endpoint                    = "35.232.239.166" -> null
-       id                          = "projects/terrateam-362405/locations/us-central1/clusters/cinema" -> null
-       initial_node_count          = 0 -> null
-       label_fingerprint           = "a9dc16a7" -> null
-       location                    = "us-central1" -> null
-       logging_service             = "logging.googleapis.com/kubernetes" -> null
-       master_version              = "1.24.3-gke.2100" -> null
-       min_master_version          = "1.24.3-gke.2100" -> null
-       monitoring_service          = "monitoring.googleapis.com/kubernetes" -> null
-       name                        = "cinema" -> null
-       network                     = "projects/terrateam-362405/global/networks/cinema" -> null
-       networking_mode             = "VPC_NATIVE" -> null
-       node_locations              = [
-           "us-central1-a",
-           "us-central1-b",
-           "us-central1-c",
        ] -> null
-       node_version                = "1.24.3-gke.2100" -> null
-       project                     = "terrateam-362405" -> null
-       remove_default_node_pool    = false -> null
-       resource_labels             = {} -> null
-       self_link                   = "https://container.googleapis.com/v1/projects/terrateam-362405/locations/us-central1/clusters/cinema" -> null
-       services_ipv4_cidr          = "10.8.0.0/16" -> null
-       subnetwork                  = "projects/terrateam-362405/regions/us-central1/subnetworks/production" -> null

-       addons_config {

-           dns_cache_config {
-               enabled = false -> null
            }

-           gce_persistent_disk_csi_driver_config {
-               enabled = true -> null
            }

-           gcp_filestore_csi_driver_config {
-               enabled = false -> null
            }

-           horizontal_pod_autoscaling {
-               disabled = false -> null
            }

-           http_load_balancing {
-               disabled = false -> null
            }

-           network_policy_config {
-               disabled = true -> null
            }
        }

-       binary_authorization {
-           enabled = false -> null
        }

-       cluster_autoscaling {
-           enabled = false -> null
        }

-       database_encryption {
-           state = "DECRYPTED" -> null
        }

-       default_snat_status {
-           disabled = false -> null
        }

-       ip_allocation_policy {
-           cluster_ipv4_cidr_block       = "10.4.1.0/24" -> null
-           cluster_secondary_range_name  = "us-central1-01-gke-01-pods" -> null
-           services_ipv4_cidr_block      = "10.8.0.0/16" -> null
-           services_secondary_range_name = "us-central1-01-gke-01-services" -> null
        }

-       logging_config {
-           enable_components = [
-               "SYSTEM_COMPONENTS",
-               "WORKLOADS",
            ] -> null
        }

-       maintenance_policy {
-           daily_maintenance_window {
-               duration   = "PT4H0M0S" -> null
-               start_time = "05:00" -> null
            }
        }

-       master_auth {
-           cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMVENDQXBXZ0F3SUJBZ0lSQU1JUU9FSkt5MHhyZFlsZ0tiVENXbUl3RFFZSktvWklodmNOQVFFTEJRQXcKTHpFdE1Dc0dBMVVFQXhNa01XSmlNR1kxTXpBdE16RmtNaTAwTXpoakxUZ3hORGN0Tm1RNFlXWTFObVkyWkdZdwpNQ0FYRFRJeU1Ea3hOakl3TVRjMU9Wb1lEekl3TlRJd09UQTRNakV4TnpVNVdqQXZNUzB3S3dZRFZRUURFeVF4ClltSXdaalV6TUMwek1XUXlMVFF6T0dNdE9ERTBOeTAyWkRoaFpqVTJaalprWmpBd2dnR2lNQTBHQ1NxR1NJYjMKRFFFQkFRVUFBNElCandBd2dnR0tBb0lCZ1FDOU83cHBqQS9FZ05kamxCSXpyaEFyZnh1dWo3ZlVDSFpxVFJZawprVXBVL25pK2ZoRDVEUE5VSnlqNkdZa3l1LzNxYm1BMFRJRlZYeklBYnQzRXlNQVRTY25NODl5WWVZOTYwcTJzCjBlNmNsb3JqYVcramNCZjZVZFRuUjcvZ0puNUNJdnlqdjRSUlJLeUYzOHVBa28vTytlZkhxc3FCK3YyYzM1V2oKem9mUFJxLzJWbW4rMmsrdFUyWi96VFp1K0FqdnVUV3pLZEN2OU9yU1o3ZEkvSmxTKzJ5ZGcxWkI2cTU3S2J3SApsdFJ0TjZYTXNNWnFnekpCc1BvUm9peWllWFIxRWlkczNUcUUwckpvQnoyQVpraUt3UEFNSXZGWHAzMSt4RGtsCnEzY0NBeWZQbkd2RFZHbkZYQ0lWVHBrOWJBYmNudGgzbUQ0MjFuVjlJb0RTZm1jMzdjR1FnMGxKTXl3SkxzZEYKVkJBeHhodjdLRkErWjhuQS9WNnRGaitGQXdTdVEvbEVqWGtHeHg4RTVYcEF0aFFFaEkyQW5jMitZb0oxYTR3WgpXUmlRWjFvck9rbzViWm91c09TaEVNUGNPTlY1VlZqK3FoMzVBd2ZmYlJibHkrcjNXS2hyRm5xd1BZWEFUQ1FTCkN6N2pMTFdFaE95QWlFOWorT0VGdmFuNVE0OENBd0VBQWFOQ01FQXdEZ1lEVlIwUEFRSC9CQVFEQWdJRU1BOEcKQTFVZEV3RUIvd1FGTUFNQkFmOHdIUVlEVlIwT0JCWUVGRXF4WkVLQnJPdFp6SnRGeG8zOEpWdzhhT0pJTUEwRwpDU3FHU0liM0RRRUJDd1VBQTRJQmdRQXZZQ3p5bWtKc1luN3hPOXM2TE03cXRka2FxQ0w0YlBWcVdJRFN5WVVqCllLK3NCcXo0eFBkL21TMlpHQmU2NW1mYU5ONE83ZFBtRTFxb3lHaCtXVzU4dHJ6TDlPRUl3aGQ0WnFTd2VMcmwKdEVUemZCSTFxNStNV3JMQkF6SnpUSFZ1RFdmdWxBcWttNnJERC9DUk8xTi94aWszbXBzM3RpSXZ2SXRYNklVdApBRVZMVlRVcUlLdzAvcldvbExmSE5VR2tzNzNjSVBYcWQ5U1FCWENYUnhhQVkrZXhlRWxSQVV2QUZGbEM1SDZjCnVvL0J0RFVRWTN2SDdjbWxyb3BpZjNHZzIxVkw3N3IzRndYMHRGVjgxaEVQZmlWVDg2Sy95QjFHZkQ2ZXIvOTQKSS9KeGJLaEE1L2ExamNoSGhIS3BkRDFPdmpXTFRGeWVXdVphNTczWUR0WGlmdHNpKzZ4WXZGcmZ3UzRzRG9USwovejZSK2NIc3JvSW85QzhSYUJOQ3UwMEordENKU3l1UEU2THpOSEx3Ykt4ZmRuOE1IVURFMUpoMHN3S1VDS01zCklCRW9GV2FPSnpYbHo5YmhObTd5YXBoOGFrdm1pbFhHUkgxdG5DQVZoMzVEZDJ6Y2pwMGJVd3VNeGVETVdnYjEKd1JyRHFLaGtpVk13M2trdVdtZEZoWVE9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> null

-           client_certificate_config {
-               issue_client_certificate = false -> null
            }
        }

-       monitoring_config {
-           enable_components = [
-               "SYSTEM_COMPONENTS",
            ] -> null
        }

-       network_policy {
-           enabled  = false -> null
-           provider = "PROVIDER_UNSPECIFIED" -> null
        }

-       node_config {
-           disk_size_gb      = 100 -> null
-           disk_type         = "pd-balanced" -> null
-           guest_accelerator = [] -> null
-           image_type        = "COS_CONTAINERD" -> null
-           labels            = {} -> null
-           local_ssd_count   = 0 -> null
-           machine_type      = "e2-medium" -> null
-           metadata          = {
-               "disable-legacy-endpoints" = "true"
            } -> null
-           oauth_scopes      = [
-               "https://www.googleapis.com/auth/logging.write",
-               "https://www.googleapis.com/auth/monitoring",
            ] -> null
-           preemptible       = false -> null
-           service_account   = "terrateam-tf@terrateam-362405.iam.gserviceaccount.com" -> null
-           spot              = false -> null
-           tags              = [
-               "gke-cinema",
-               "gke-cinema-default-pool",
            ] -> null
-           taint             = [] -> null

-           shielded_instance_config {
-               enable_integrity_monitoring = true -> null
-               enable_secure_boot          = false -> null
            }

-           workload_metadata_config {
-               mode = "GKE_METADATA" -> null
            }
        }

-       node_pool {
-           initial_node_count          = 0 -> null
-           instance_group_urls         = [
-               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-a/instanceGroupManagers/gke-cinema-default-pool-c8faa117-grp",
-               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-b/instanceGroupManagers/gke-cinema-default-pool-5f183e2f-grp",
-               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-c/instanceGroupManagers/gke-cinema-default-pool-ad2acbbe-grp",
            ] -> null
-           managed_instance_group_urls = [
-               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-a/instanceGroups/gke-cinema-default-pool-c8faa117-grp",
-               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-b/instanceGroups/gke-cinema-default-pool-5f183e2f-grp",
-               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-c/instanceGroups/gke-cinema-default-pool-ad2acbbe-grp",
            ] -> null
-           max_pods_per_node           = 128 -> null
-           name                        = "default-pool" -> null
-           node_count                  = 0 -> null
-           node_locations              = [
-               "us-central1-a",
-               "us-central1-b",
-               "us-central1-c",
            ] -> null
-           version                     = "1.24.3-gke.2100" -> null

-           management {
-               auto_repair  = true -> null
-               auto_upgrade = true -> null
            }

-           node_config {
-               disk_size_gb      = 100 -> null
-               disk_type         = "pd-balanced" -> null
-               guest_accelerator = [] -> null
-               image_type        = "COS_CONTAINERD" -> null
-               labels            = {} -> null
-               local_ssd_count   = 0 -> null
-               machine_type      = "e2-medium" -> null
-               metadata          = {
-                   "disable-legacy-endpoints" = "true"
                } -> null
-               oauth_scopes      = [
-                   "https://www.googleapis.com/auth/logging.write",
-                   "https://www.googleapis.com/auth/monitoring",
                ] -> null
-               preemptible       = false -> null
-               service_account   = "terrateam-tf@terrateam-362405.iam.gserviceaccount.com" -> null
-               spot              = false -> null
-               tags              = [
-                   "gke-cinema",
-                   "gke-cinema-default-pool",
                ] -> null
-               taint             = [] -> null

-               shielded_instance_config {
-                   enable_integrity_monitoring = true -> null
-                   enable_secure_boot          = false -> null
                }

-               workload_metadata_config {
-                   mode = "GKE_METADATA" -> null
                }
            }

-           upgrade_settings {
-               max_surge       = 1 -> null
-               max_unavailable = 0 -> null
            }
        }
-       node_pool {
-           initial_node_count          = 1 -> null
-           instance_group_urls         = [
-               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-a/instanceGroupManagers/gke-cinema-core-5a9b863c-grp",
-               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-b/instanceGroupManagers/gke-cinema-core-b441c40a-grp",
-               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-c/instanceGroupManagers/gke-cinema-core-f83e8319-grp",
            ] -> null
-           managed_instance_group_urls = [
-               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-a/instanceGroups/gke-cinema-core-5a9b863c-grp",
-               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-b/instanceGroups/gke-cinema-core-b441c40a-grp",
-               "https://www.googleapis.com/compute/v1/projects/terrateam-362405/zones/us-central1-c/instanceGroups/gke-cinema-core-f83e8319-grp",
            ] -> null
-           max_pods_per_node           = 128 -> null
-           name                        = "core" -> null
-           node_count                  = 1 -> null
-           node_locations              = [
-               "us-central1-a",
-               "us-central1-b",
-               "us-central1-c",
            ] -> null
-           version                     = "1.24.3-gke.2100" -> null

-           autoscaling {
-               max_node_count       = 6 -> null
-               min_node_count       = 3 -> null
-               total_max_node_count = 0 -> null
-               total_min_node_count = 0 -> null
            }

-           management {
-               auto_repair  = true -> null
-               auto_upgrade = true -> null
            }

-           node_config {
-               disk_size_gb      = 15 -> null
-               disk_type         = "pd-standard" -> null
-               guest_accelerator = [] -> null
-               image_type        = "COS_CONTAINERD" -> null
-               labels            = {
-                   "cluster_name" = "cinema"
-                   "node_pool"    = "core"
                } -> null
-               local_ssd_count   = 0 -> null
-               machine_type      = "e2-medium" -> null
-               metadata          = {
-                   "cluster_name"             = "cinema"
-                   "disable-legacy-endpoints" = "true"
-                   "node_pool"                = "core"
                } -> null
-               oauth_scopes      = [
-                   "https://www.googleapis.com/auth/logging.write",
-                   "https://www.googleapis.com/auth/monitoring",
                ] -> null
-               preemptible       = false -> null
-               service_account   = "terrateam-tf@terrateam-362405.iam.gserviceaccount.com" -> null
-               spot              = false -> null
-               tags              = [
-                   "gke-cinema",
-                   "gke-cinema-core",
                ] -> null
-               taint             = [] -> null

-               shielded_instance_config {
-                   enable_integrity_monitoring = true -> null
-                   enable_secure_boot          = false -> null
                }

-               workload_metadata_config {
-                   mode = "GKE_METADATA" -> null
                }
            }

-           upgrade_settings {
-               max_surge       = 1 -> null
-               max_unavailable = 0 -> null
            }
        }

-       notification_config {
-           pubsub {
-               enabled = false -> null
            }
        }

-       release_channel {
-           channel = "UNSPECIFIED" -> null
        }

-       service_external_ips_config {
-           enabled = false -> null
        }

-       timeouts {
-           create = "45m" -> null
-           delete = "45m" -> null
-           update = "45m" -> null
        }

-       vertical_pod_autoscaling {
-           enabled = false -> null
        }

-       workload_identity_config {
-           workload_pool = "terrateam-362405.svc.id.goog" -> null
        }
    }

  # module.vpc-cinema.module.subnets.google_compute_subnetwork.subnetwork["us-central1/production"] has changed
!   resource "google_compute_subnetwork" "subnetwork" {
        id                         = "projects/terrateam-362405/regions/us-central1/subnetworks/production"
        name                       = "production"
!       private_ip_google_access   = true -> false
        # (11 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # helm_release.cert-manager will be created
+   resource "helm_release" "cert-manager" {
+       atomic                     = false
+       chart                      = "cert-manager"
+       cleanup_on_fail            = false
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "cert-manager"
+       namespace                  = "kube-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://charts.jetstack.io"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 120
+       verify                     = false
+       version                    = "v1.5.3"
+       wait                       = true
+       wait_for_jobs              = false

+       set {
+           name  = "createCustomResource"
+           value = "true"
        }
+       set {
+           name  = "installCRDs"
+           value = "true"
        }
    }

  # helm_release.cinema will be created
+   resource "helm_release" "cinema" {
+       atomic                     = false
+       chart                      = "../charts/cinema"
+       cleanup_on_fail            = false
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "cinema"
+       namespace                  = "cinema"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "0.2.1"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # helm_release.cluster-issuer will be created
+   resource "helm_release" "cluster-issuer" {
+       atomic                     = false
+       chart                      = "../charts/cluster-issuer"
+       cleanup_on_fail            = false
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "cluster-issuer"
+       namespace                  = "kube-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "0.0.2"
+       wait                       = true
+       wait_for_jobs              = false

+       set {
+           name  = "zerossl_eab_hmac_key"
+           value = "lvQC_f5Q2QQtTF0b32ko-G2ePa3hiYz2cajnbfe6hXLp1uVwHRubcZtf5k66_Qp3585V1L17rMWr5nF4MgSAQg"
        }
+       set {
+           name  = "zerossl_eab_hmac_key_id"
+           value = "lvQC_f5Q2QQtTF0b32ko-G2ePa3hiYz2cajnbfe6hXLp1uVwHRubcZtf5k66_Qp3585V1L17rMWr5nF4MgSAQg"
        }
+       set {
+           name  = "zerossl_email"
+           value = "service@contrasting.org"
        }
    }

  # helm_release.nginx_ingress_chart will be created
+   resource "helm_release" "nginx_ingress_chart" {
+       atomic                     = false
+       chart                      = "nginx-ingress-controller"
+       cleanup_on_fail            = false
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "nginx-ingress-controller"
+       namespace                  = "default"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://charts.bitnami.com/bitnami"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "9.3.11"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # kubernetes_namespace.cinema will be created
+   resource "kubernetes_namespace" "cinema" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "cinema"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.zerossl_eab_hmac_key will be created
+   resource "kubernetes_secret" "zerossl_eab_hmac_key" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "kubernetes.io/opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "zerossl-hmac-key"
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.zerossl_eab_hmac_key_id will be created
+   resource "kubernetes_secret" "zerossl_eab_hmac_key_id" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "kubernetes.io/opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "zerossl-hmac-key-id"
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.gke-cinema.data.google_compute_zones.available will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_compute_zones" "available" {
+       id      = (known after apply)
+       names   = (known after apply)
+       project = "terrateam-362405"
+       region  = "us-central1"
    }

  # module.gke-cinema.data.google_container_engine_versions.region will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_engine_versions" "region" {
+       default_cluster_version         = (known after apply)
+       id                              = (known after apply)
+       latest_master_version           = (known after apply)
+       latest_node_version             = (known after apply)
+       location                        = "us-central1"
+       project                         = "terrateam-362405"
+       release_channel_default_version = (known after apply)
+       valid_master_versions           = (known after apply)
+       valid_node_versions             = (known after apply)
    }

  # module.gke-cinema.data.google_container_engine_versions.zone will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_engine_versions" "zone" {
+       default_cluster_version         = (known after apply)
+       id                              = (known after apply)
+       latest_master_version           = (known after apply)
+       latest_node_version             = (known after apply)
+       location                        = "us-central1-a"
+       project                         = "terrateam-362405"
+       release_channel_default_version = (known after apply)
+       valid_master_versions           = (known after apply)
+       valid_node_versions             = (known after apply)
    }

  # module.gke-cinema.google_container_cluster.primary will be created
+   resource "google_container_cluster" "primary" {
+       cluster_ipv4_cidr           = (known after apply)
+       datapath_provider           = (known after apply)
+       default_max_pods_per_node   = 128
+       enable_binary_authorization = false
+       enable_intranode_visibility = (known after apply)
+       enable_kubernetes_alpha     = false
+       enable_legacy_abac          = false
+       enable_shielded_nodes       = true
+       endpoint                    = (known after apply)
+       id                          = (known after apply)
+       label_fingerprint           = (known after apply)
+       location                    = "us-central1"
+       logging_service             = "logging.googleapis.com/kubernetes"
+       master_version              = (known after apply)
+       min_master_version          = (known after apply)
+       monitoring_service          = "monitoring.googleapis.com/kubernetes"
+       name                        = "cinema"
+       network                     = "projects/terrateam-362405/global/networks/cinema"
+       networking_mode             = (known after apply)
+       node_locations              = [
+           "us-central1-a",
+           "us-central1-b",
+           "us-central1-c",
        ]
+       node_version                = (known after apply)
+       operation                   = (known after apply)
+       private_ipv6_google_access  = (known after apply)
+       project                     = "terrateam-362405"
+       remove_default_node_pool    = false
+       self_link                   = (known after apply)
+       services_ipv4_cidr          = (known after apply)
+       subnetwork                  = "projects/terrateam-362405/regions/us-central1/subnetworks/production"
+       tpu_ipv4_cidr_block         = (known after apply)

+       addons_config {
+           cloudrun_config {
+               disabled           = (known after apply)
+               load_balancer_type = (known after apply)
            }

+           dns_cache_config {
+               enabled = false
            }

+           gce_persistent_disk_csi_driver_config {
+               enabled = (known after apply)
            }

+           gcp_filestore_csi_driver_config {
+               enabled = false
            }

+           horizontal_pod_autoscaling {
+               disabled = false
            }

+           http_load_balancing {
+               disabled = false
            }

+           network_policy_config {
+               disabled = true
            }
        }

+       authenticator_groups_config {
+           security_group = (known after apply)
        }

+       cluster_autoscaling {
+           enabled = false

+           auto_provisioning_defaults {
+               boot_disk_kms_key = (known after apply)
+               image_type        = (known after apply)
+               oauth_scopes      = (known after apply)
+               service_account   = (known after apply)
            }
        }

+       confidential_nodes {
+           enabled = (known after apply)
        }

+       database_encryption {
+           state = "DECRYPTED"
        }

+       default_snat_status {
+           disabled = false
        }

+       ip_allocation_policy {
+           cluster_ipv4_cidr_block       = (known after apply)
+           cluster_secondary_range_name  = "us-central1-01-gke-01-pods"
+           services_ipv4_cidr_block      = (known after apply)
+           services_secondary_range_name = "us-central1-01-gke-01-services"
        }

+       logging_config {
+           enable_components = (known after apply)
        }

+       maintenance_policy {
+           daily_maintenance_window {
+               duration   = (known after apply)
+               start_time = "05:00"
            }
        }

+       master_auth {
+           client_certificate     = (known after apply)
+           client_key             = (sensitive value)
+           cluster_ca_certificate = (known after apply)

+           client_certificate_config {
+               issue_client_certificate = false
            }
        }

+       mesh_certificates {
+           enable_certificates = (known after apply)
        }

+       monitoring_config {
+           enable_components = (known after apply)
        }

+       network_policy {
+           enabled = false
        }

+       node_config {
+           boot_disk_kms_key = (known after apply)
+           disk_size_gb      = (known after apply)
+           disk_type         = (known after apply)
+           guest_accelerator = (known after apply)
+           image_type        = (known after apply)
+           labels            = (known after apply)
+           local_ssd_count   = (known after apply)
+           machine_type      = (known after apply)
+           metadata          = (known after apply)
+           min_cpu_platform  = (known after apply)
+           node_group        = (known after apply)
+           oauth_scopes      = (known after apply)
+           preemptible       = (known after apply)
+           service_account   = (known after apply)
+           spot              = (known after apply)
+           tags              = (known after apply)
+           taint             = (known after apply)

+           gcfs_config {
+               enabled = (known after apply)
            }

+           gvnic {
+               enabled = (known after apply)
            }

+           reservation_affinity {
+               consume_reservation_type = (known after apply)
+               key                      = (known after apply)
+               values                   = (known after apply)
            }

+           shielded_instance_config {
+               enable_integrity_monitoring = (known after apply)
+               enable_secure_boot          = (known after apply)
            }

+           workload_metadata_config {
+               mode = (known after apply)
            }
        }

+       node_pool {
+           initial_node_count          = 0
+           instance_group_urls         = (known after apply)
+           managed_instance_group_urls = (known after apply)
+           max_pods_per_node           = (known after apply)
+           name                        = "default-pool"
+           name_prefix                 = (known after apply)
+           node_count                  = (known after apply)
+           node_locations              = (known after apply)
+           version                     = (known after apply)

+           management {
+               auto_repair  = (known after apply)
+               auto_upgrade = (known after apply)
            }

+           node_config {
+               disk_size_gb      = (known after apply)
+               disk_type         = (known after apply)
+               guest_accelerator = (known after apply)
+               image_type        = "COS_CONTAINERD"
+               labels            = (known after apply)
+               local_ssd_count   = (known after apply)
+               machine_type      = "e2-medium"
+               metadata          = (known after apply)
+               min_cpu_platform  = (known after apply)
+               oauth_scopes      = (known after apply)
+               preemptible       = false
+               service_account   = "terrateam-tf@terrateam-362405.iam.gserviceaccount.com"
+               spot              = false
+               tags              = [
+                   "gke-cinema",
+                   "gke-cinema-default-pool",
                ]
+               taint             = (known after apply)

+               shielded_instance_config {
+                   enable_integrity_monitoring = true
+                   enable_secure_boot          = false
                }

+               workload_metadata_config {
+                   mode = "GKE_METADATA"
                }
            }

+           upgrade_settings {
+               max_surge       = (known after apply)
+               max_unavailable = (known after apply)
            }
        }

+       notification_config {
+           pubsub {
+               enabled = false
            }
        }

+       release_channel {
+           channel = (known after apply)
        }

+       service_external_ips_config {
+           enabled = (known after apply)
        }

+       timeouts {
+           create = "45m"
+           delete = "45m"
+           update = "45m"
        }

+       vertical_pod_autoscaling {
+           enabled = false
        }

+       workload_identity_config {
+           workload_pool = "terrateam-362405.svc.id.goog"
        }
    }

  # module.gke-cinema.google_container_node_pool.pools["core"] will be created
+   resource "google_container_node_pool" "pools" {
+       cluster                     = "cinema"
+       id                          = (known after apply)
+       initial_node_count          = 1
+       instance_group_urls         = (known after apply)
+       location                    = "us-central1"
+       managed_instance_group_urls = (known after apply)
+       max_pods_per_node           = (known after apply)
+       name                        = "core"
+       name_prefix                 = (known after apply)
+       node_count                  = (known after apply)
+       node_locations              = [
+           "us-central1-a",
+           "us-central1-b",
+           "us-central1-c",
        ]
+       operation                   = (known after apply)
+       project                     = "terrateam-362405"
+       version                     = (known after apply)

+       autoscaling {
+           max_node_count = 6
+           min_node_count = 3
        }

+       management {
+           auto_repair  = true
+           auto_upgrade = true
        }

+       node_config {
+           disk_size_gb      = 15
+           disk_type         = "pd-standard"
+           guest_accelerator = []
+           image_type        = "COS_CONTAINERD"
+           labels            = {
+               "cluster_name" = "cinema"
+               "node_pool"    = "core"
            }
+           local_ssd_count   = 0
+           machine_type      = "e2-medium"
+           metadata          = {
+               "cluster_name"             = "cinema"
+               "disable-legacy-endpoints" = "true"
+               "node_pool"                = "core"
            }
+           min_cpu_platform  = (known after apply)
+           oauth_scopes      = [
+               "https://www.googleapis.com/auth/logging.write",
+               "https://www.googleapis.com/auth/monitoring",
            ]
+           preemptible       = false
+           service_account   = "terrateam-tf@terrateam-362405.iam.gserviceaccount.com"
+           spot              = false
+           tags              = [
+               "gke-cinema",
+               "gke-cinema-core",
            ]
+           taint             = (known after apply)

+           shielded_instance_config {
+               enable_integrity_monitoring = true
+               enable_secure_boot          = false
            }

+           workload_metadata_config {
+               mode = "GKE_METADATA"
            }
        }

+       timeouts {
+           create = "45m"
+           delete = "45m"
+           update = "45m"
        }

+       upgrade_settings {
+           max_surge       = 1
+           max_unavailable = 0
        }
    }

  # module.gke-cinema.random_shuffle.available_zones will be created
+   resource "random_shuffle" "available_zones" {
+       id           = (known after apply)
+       input        = (known after apply)
+       result       = (known after apply)
+       result_count = 3
    }

  # module.vpc-cinema.module.subnets.google_compute_subnetwork.subnetwork["us-central1/production"] will be updated in-place
!   resource "google_compute_subnetwork" "subnetwork" {
        id                         = "projects/terrateam-362405/regions/us-central1/subnetworks/production"
        name                       = "production"
!       secondary_ip_range         = [
+           {
+               ip_cidr_range = "10.4.0.0/16"
+               range_name    = "us-central1-01-gke-01-pods"
            },
            {
                ip_cidr_range = "10.8.0.0/16"
                range_name    = "us-central1-01-gke-01-services"
            },
-           {
-               ip_cidr_range = "10.4.1.0/24"
-               range_name    = "us-central1-01-gke-01-pods"
            },
        ]
        # (11 unchanged attributes hidden)
    }

Plan: 10 to add, 1 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
